BenchmarkScripts/ConcurrentClients/results/redisAggregated_1x30gb_5cclients.txt
Results for Redis on port 6379:
1         Threads
5         Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        10562.74          ---          ---         0.04299         0.04700         0.11100         0.18300       813.75 
Gets       105627.36     10181.61     95445.75         0.04225         0.04700         0.11100         0.18300      4452.67 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     116190.10     10181.61     95445.75         0.04232         0.04700         0.11100         0.18300      5266.42 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.015        0.000
SET       0.031        5.000
SET       0.031       10.000
SET       0.031       15.000
SET       0.031       20.000
SET       0.031       25.000
SET       0.039       30.000
SET       0.039       35.000
SET       0.039       40.000
SET       0.047       45.000
SET       0.047       50.000
SET       0.047       52.500
SET       0.047       55.000
SET       0.047       57.500
SET       0.047       60.000
SET       0.047       62.500
SET       0.047       65.000
SET       0.047       67.500
SET       0.047       70.000
SET       0.047       72.500
SET       0.055       75.000
SET       0.055       76.250
SET       0.055       77.500
SET       0.055       78.750
SET       0.055       80.000
SET       0.055       81.250
SET       0.055       82.500
SET       0.055       83.750
SET       0.055       85.000
SET       0.055       86.250
SET       0.063       87.500
SET       0.063       88.125
SET       0.063       88.750
SET       0.063       89.375
SET       0.063       90.000
SET       0.063       90.625
SET       0.063       91.250
SET       0.063       91.875
SET       0.063       92.500
SET       0.063       93.125
SET       0.071       93.750
SET       0.071       94.062
SET       0.071       94.375
SET       0.071       94.688
SET       0.071       95.000
SET       0.071       95.312
SET       0.071       95.625
SET       0.079       95.938
SET       0.079       96.250
SET       0.079       96.562
SET       0.079       96.875
SET       0.079       97.031
SET       0.079       97.188
SET       0.087       97.344
SET       0.087       97.500
SET       0.087       97.656
SET       0.087       97.812
SET       0.087       97.969
SET       0.095       98.125
SET       0.095       98.281
SET       0.095       98.438
SET       0.095       98.516
SET       0.103       98.594
SET       0.103       98.672
SET       0.103       98.750
SET       0.103       98.828
SET       0.103       98.906
SET       0.111       98.984
SET       0.111       99.062
SET       0.111       99.141
SET       0.119       99.219
SET       0.119       99.258
SET       0.119       99.297
SET       0.119       99.336
SET       0.119       99.375
SET       0.127       99.414
SET       0.127       99.453
SET       0.127       99.492
SET       0.135       99.531
SET       0.135       99.570
SET       0.135       99.609
SET       0.143       99.629
SET       0.143       99.648
SET       0.143       99.668
SET       0.143       99.688
SET       0.151       99.707
SET       0.151       99.727
SET       0.151       99.746
SET       0.159       99.766
SET       0.159       99.785
SET       0.167       99.805
SET       0.167       99.814
SET       0.167       99.824
SET       0.167       99.834
SET       0.167       99.844
SET       0.175       99.854
SET       0.175       99.863
SET       0.175       99.873
SET       0.183       99.883
SET       0.183       99.893
SET       0.183       99.902
SET       0.183       99.907
SET       0.191       99.912
SET       0.191       99.917
SET       0.191       99.922
SET       0.191       99.927
SET       0.191       99.932
SET       0.199       99.937
SET       0.199       99.941
SET       0.199       99.946
SET       0.207       99.951
SET       0.207       99.954
SET       0.207       99.956
SET       0.207       99.958
SET       0.207       99.961
SET       0.215       99.963
SET       0.215       99.966
SET       0.215       99.968
SET       0.215       99.971
SET       0.223       99.973
SET       0.223       99.976
SET       0.223       99.977
SET       0.223       99.978
SET       0.231       99.979
SET       0.231       99.980
SET       0.231       99.982
SET       0.231       99.983
SET       0.239       99.984
SET       0.239       99.985
SET       0.239       99.987
SET       0.247       99.988
SET       0.247       99.988
SET       0.247       99.989
SET       0.247       99.990
SET       0.255       99.990
SET       0.255       99.991
SET       0.255       99.991
SET       0.263       99.992
SET       0.263       99.993
SET       0.271       99.993
SET       0.279       99.994
SET       0.279       99.994
SET       0.279       99.995
SET       0.287       99.995
SET       0.287       99.995
SET       0.295       99.995
SET       0.295       99.996
SET       0.303       99.996
SET       0.303       99.996
SET       0.311       99.997
SET       0.311       99.997
SET       0.319       99.997
SET       0.319       99.997
SET       0.327       99.997
SET       0.327       99.998
SET       0.335       99.998
SET       0.335       99.998
SET       0.351       99.998
SET       0.351       99.998
SET       0.367       99.998
SET       0.383       99.998
SET       0.391       99.999
SET       0.399       99.999
SET       0.399       99.999
SET       0.407       99.999
SET       0.423       99.999
SET       0.439       99.999
SET       0.447       99.999
SET       0.447       99.999
SET       0.479       99.999
SET       0.495       99.999
SET       0.527       99.999
SET       0.559       99.999
SET       0.583       99.999
SET       0.599       99.999
SET       0.615       99.999
SET       0.647       99.999
SET       0.671      100.000
SET       0.687      100.000
SET       0.711      100.000
SET       0.719      100.000
SET       0.751      100.000
SET       0.791      100.000
SET       0.855      100.000
SET       0.887      100.000
SET       0.887      100.000
SET       0.975      100.000
SET       0.991      100.000
SET       0.999      100.000
SET       1.015      100.000
SET       1.271      100.000
SET       1.367      100.000
SET       1.383      100.000
SET       1.383      100.000
SET       1.631      100.000
SET       1.631      100.000
SET       1.647      100.000
SET       1.671      100.000
SET       1.671      100.000
SET       1.807      100.000
SET       1.807      100.000
SET       2.039      100.000
SET       2.039      100.000
SET       2.039      100.000
SET       2.079      100.000
SET       2.079      100.000
SET       2.079      100.000
SET       2.095      100.000
SET       2.095      100.000
SET       2.095      100.000
[...]
SET       2.111      100.000
SET       2.111      100.000
SET       2.111      100.000
[...]
SET       2.127      100.000
SET       2.127      100.000
---
GET       0.015        0.000
GET       0.031        5.000
GET       0.031       10.000
GET       0.031       15.000
GET       0.031       20.000
GET       0.031       25.000
GET       0.039       30.000
GET       0.039       35.000
GET       0.039       40.000
GET       0.039       45.000
GET       0.047       50.000
GET       0.047       52.500
GET       0.047       55.000
GET       0.047       57.500
GET       0.047       60.000
GET       0.047       62.500
GET       0.047       65.000
GET       0.047       67.500
GET       0.047       70.000
GET       0.047       72.500
GET       0.047       75.000
GET       0.055       76.250
GET       0.055       77.500
GET       0.055       78.750
GET       0.055       80.000
GET       0.055       81.250
GET       0.055       82.500
GET       0.055       83.750
GET       0.055       85.000
GET       0.055       86.250
GET       0.055       87.500
GET       0.055       88.125
GET       0.055       88.750
GET       0.063       89.375
GET       0.063       90.000
GET       0.063       90.625
GET       0.063       91.250
GET       0.063       91.875
GET       0.063       92.500
GET       0.063       93.125
GET       0.063       93.750
GET       0.071       94.062
GET       0.071       94.375
GET       0.071       94.688
GET       0.071       95.000
GET       0.071       95.312
GET       0.071       95.625
GET       0.071       95.938
GET       0.079       96.250
GET       0.079       96.562
GET       0.079       96.875
GET       0.079       97.031
GET       0.079       97.188
GET       0.079       97.344
GET       0.087       97.500
GET       0.087       97.656
GET       0.087       97.812
GET       0.087       97.969
GET       0.087       98.125
GET       0.095       98.281
GET       0.095       98.438
GET       0.095       98.516
GET       0.095       98.594
GET       0.103       98.672
GET       0.103       98.750
GET       0.103       98.828
GET       0.103       98.906
GET       0.111       98.984
GET       0.111       99.062
GET       0.111       99.141
GET       0.111       99.219
GET       0.119       99.258
GET       0.119       99.297
GET       0.119       99.336
GET       0.119       99.375
GET       0.127       99.414
GET       0.127       99.453
GET       0.127       99.492
GET       0.127       99.531
GET       0.135       99.570
GET       0.135       99.609
GET       0.135       99.629
GET       0.143       99.648
GET       0.143       99.668
GET       0.143       99.688
GET       0.151       99.707
GET       0.151       99.727
GET       0.151       99.746
GET       0.159       99.766
GET       0.159       99.785
GET       0.159       99.805
GET       0.167       99.814
GET       0.167       99.824
GET       0.167       99.834
GET       0.167       99.844
GET       0.175       99.854
GET       0.175       99.863
GET       0.175       99.873
GET       0.175       99.883
GET       0.183       99.893
GET       0.183       99.902
GET       0.183       99.907
GET       0.183       99.912
GET       0.191       99.917
GET       0.191       99.922
GET       0.191       99.927
GET       0.191       99.932
GET       0.199       99.937
GET       0.199       99.941
GET       0.199       99.946
GET       0.199       99.951
GET       0.207       99.954
GET       0.207       99.956
GET       0.207       99.958
GET       0.207       99.961
GET       0.207       99.963
GET       0.215       99.966
GET       0.215       99.968
GET       0.215       99.971
GET       0.223       99.973
GET       0.223       99.976
GET       0.223       99.977
GET       0.223       99.978
GET       0.223       99.979
GET       0.231       99.980
GET       0.231       99.982
GET       0.231       99.983
GET       0.231       99.984
GET       0.239       99.985
GET       0.239       99.987
GET       0.239       99.988
GET       0.247       99.988
GET       0.247       99.989
GET       0.247       99.990
GET       0.247       99.990
GET       0.255       99.991
GET       0.255       99.991
GET       0.255       99.992
GET       0.263       99.993
GET       0.271       99.993
GET       0.271       99.994
GET       0.279       99.994
GET       0.279       99.995
GET       0.279       99.995
GET       0.287       99.995
GET       0.287       99.995
GET       0.295       99.996
GET       0.295       99.996
GET       0.303       99.996
GET       0.303       99.997
GET       0.311       99.997
GET       0.319       99.997
GET       0.319       99.997
GET       0.327       99.997
GET       0.335       99.998
GET       0.343       99.998
GET       0.351       99.998
GET       0.359       99.998
GET       0.367       99.998
GET       0.383       99.998
GET       0.391       99.998
GET       0.407       99.999
GET       0.415       99.999
GET       0.431       99.999
GET       0.447       99.999
GET       0.463       99.999
GET       0.479       99.999
GET       0.503       99.999
GET       0.535       99.999
GET       0.567       99.999
GET       0.591       99.999
GET       0.631       99.999
GET       0.655       99.999
GET       0.695       99.999
GET       0.727       99.999
GET       0.751       99.999
GET       0.831       99.999
GET       0.871      100.000
GET       0.943      100.000
GET       1.079      100.000
GET       1.239      100.000
GET       1.279      100.000
GET       1.415      100.000
GET       1.607      100.000
GET       1.631      100.000
GET       1.679      100.000
GET       1.735      100.000
GET       1.791      100.000
GET       2.047      100.000
GET       2.063      100.000
GET       2.063      100.000
GET       2.063      100.000
GET       2.079      100.000
GET       2.079      100.000
GET       2.079      100.000
[...]
GET       2.095      100.000
GET       2.095      100.000
GET       2.095      100.000
[...]
GET       2.111      100.000
GET       2.111      100.000
GET       2.111      100.000
[...]
GET       2.127      100.000
GET       2.127      100.000
GET       2.127      100.000
[...]
GET       2.143      100.000
GET       2.143      100.000
GET       2.143      100.000
[...]
GET       2.223      100.000
GET       2.223      100.000
GET       2.239      100.000
GET       2.239      100.000
GET       2.239      100.000
GET       2.255      100.000
GET       2.255      100.000
GET       3.679      100.000
GET       3.679      100.000
GET       3.679      100.000
GET       3.711      100.000
GET       3.711      100.000
GET       3.711      100.000
[...]
GET       3.743      100.000
GET       3.743      100.000
GET       3.743      100.000
[...]
GET       3.759      100.000
GET       3.759      100.000
---
WAIT      0.000      100.000